cask_args appdir: '/Applications'

# taps
tap "jesseduffield/lazydocker"
tap "pluk-inc/tap"
tap "anomalyco/tap"

# base
brew "stow"
brew "nvim"
cask "ghostty"
brew "zellij"
brew "tmux"
brew "tmuxp"
brew "lazygit"
brew "lazydocker"
brew "zsh-autosuggestions"
brew "zsh-autocomplete"
cask "font-iosevka-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "markdown-preview"

# utils
brew "curl"
brew "wget"
brew "fzf"
brew "rg"
brew "fd"
brew "eza"
brew "bat"
brew "jq"
brew "yq"
brew "watch"
brew "reattach-to-user-namespace"

# ai
brew "ollama"
brew "anomalyco/tap/opencode"

# dev
brew "autoconf"
brew "shellcheck"
brew "automake"
brew "cmake"
brew "gcc"
brew "protobuf"
brew "pandoc"
brew "tree-sitter-cli"
brew "fonttools"
brew "luarocks"
brew "lua-language-server"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "pyenv-virtualenv"
brew "bash-language-server"
brew "yaml-language-server"
brew "pyright"
brew "marksman"

# system
brew "spotify_player"

# work
brew "kind"
brew "grpcurl"
brew "k9s"
brew "gh"
brew "glab"
brew "awscli"
brew "yarn"
brew "node"
brew "sqlite"
