cask_args appdir: '/Applications'

# taps
tap "jesseduffield/lazydocker"

# base
cask "hammerspoon"
brew "nvim"
cask "wezterm"
brew "tmux"
brew "tmuxp"
brew "lazygit"
brew "lazydocker" 
brew "stow"
brew "zsh-autosuggestions"
brew "zsh-autocomplete"
cask "font-iosevka-nerd-font"

# utils
brew "curl"
brew "wget"
brew "fzf"
brew "rg"
brew "fd"
brew "eza"
brew "bat"
brew "jq"
brew "yq"
brew "watch"
brew "reattach-to-user-namespace"

# dev
brew "autoconf"
brew "automake"
brew "cmake"
brew "gcc"
brew "golang"
brew "yarn"
brew "node"
brew "sqlite"
brew "lua-language-server"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "pyright"
brew "pyenv-virtualenv"
brew "marksman"
brew "luarocks"
brew "protobuf"
brew "pandoc"
brew "tree-sitter-cli"

# system
brew "spotify_player"
brew "caffeine"
brew "pass"

# work
brew "kind"
brew "grpcurl"
brew "k9s"
brew "glab"
brew "awscli"
brew "helm"
cask "docker"
cask "postman"
cask "orbstack"
cask "bruno"
